In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8],[66,64,45,35],[354,46,335,343],[455,45,343,23]])

In [4]:
df

     0   1    2    3
0    1   2    3    4
1    5   6    7    8
2   66  64   45   35
3  354  46  335  343
4  455  45  343   23

In [5]:
df.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [6]:
df.tail(3)

     0   1    2    3
2   66  64   45   35
3  354  46  335  343
4  455  45  343   23

In [7]:
df.shape

(5, 4)

In [9]:
df.iloc[0:2,0:2]

   0  1
0  1  2
1  5  6

In [10]:
df.iloc[0:3,2:4]

    2   3
0   3   4
1   7   8
2  45  35

In [11]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8],[66,64,45,35],[354,46,335,343],[455,45,343,23]], columns=['A','B','C','D'])

In [12]:
df

     A   B    C    D
0    1   2    3    4
1    5   6    7    8
2   66  64   45   35
3  354  46  335  343
4  455  45  343   23

In [14]:
df1 = pd.read_csv('3dprinter.csv')
df1.head(5)

,layer_height,wall_thickness,infill_density,nozzle_temperature,bed_temperature,print_speed,fan_speed,roughness,tension_strength,elongation
0,0.02,8,90,220,60,40,0,25,18,1.2
1,0.02,7,90,225,65,40,25,32,16,1.4
2,0.02,1,80,230,70,40,50,40,8,0.8
3,0.02,4,70,240,75,40,75,68,10,0.5
4,0.02,6,90,250,80,40,100,92,5,0.7

In [18]:
print(df1['nozzle_temperature'].dtype)

int64

In [19]:
print(df1['layer_height'].dtype)

float64

In [22]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8],[66,64,45,35],[354,46,335,343],[455,45,343,23]], columns=['A','B','C','D'])
df

     A   B    C    D
0    1   2    3    4
1    5   6    7    8
2   66  64   45   35
3  354  46  335  343
4  455  45  343   23

In [21]:
df.to_csv('ExportPrinting.csv')